Autodesk.Revit.DB.InCanvasControlData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.InCanvasControlData.ImagePath
The path to the image file to be used.
This must be an absolute path to a location on disk.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The file format specified by imagePath is an unsupported format - only *.bmp files are supported.
-or-
When setting this property: The file path specified by imagePath is not absolute.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
When setting this property: The  file specified by imagePath doesn't exist.
Since:
2022

Autodesk.Revit.DB.InCanvasControlData.Position
The position of the in-canvas control in model coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.InCanvasControlData.#ctor(System.String,Autodesk.Revit.DB.XYZ)
Constructs an InCanvasControlData with specific values assigned.
imagePath:
File path with the image to be used.
This must be an absolute path to a location on disk.
position:
The position to be used.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The file format specified by imagePath is an unsupported format - only *.bmp files are supported.
-or-
The file path specified by imagePath is not absolute.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The  file specified by imagePath doesn't exist.
Since:
2022

Autodesk.Revit.DB.InCanvasControlData.#ctor(System.String)
Constructs an InCanvasControlData with specific values assigned.
imagePath:
File path with the image to be used.
This must be an absolute path to a location on disk.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The file format specified by imagePath is an unsupported format - only *.bmp files are supported.
-or-
The file path specified by imagePath is not absolute.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The  file specified by imagePath doesn't exist.
Since:
2022

Autodesk.Revit.DB.InCanvasControlData
Represents a collection of data which is used by Autodesk::Revit::DB::TemporaryGraphicsManager to create and update an in-canvas control.
Remarks:
So far, only bitmap file is supported for Autodesk.Revit.DB.InCanvasControlData.ImagePath. The rendered image is the same size
in pixel dimensions as the original one. To get a better result, the caller should prepare the image with proper size, for exmaple: 32x32 or 64x64 in pixels,
before use. To achive a "transparent" backgound color effect over the provided bitmap, the bitmap should use color RGB(0, 128, 128) as its background and
it will be cleared during rendering by Revit.
Since:
2022